# Pandas GROUP BY

Group By allows you to group together rows based off a column and to perform various aggregate functions on them.

In [1]:
import numpy as np
import pandas as pd

In [6]:
#Create a dictionary

data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam', 'Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [7]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [10]:
#Create a dictioanry by passing the data frame

df = pd.DataFrame(data)

In [11]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
df.groupby('Company')

#The o/p is the group by object and it points to the memory location

In [15]:
#Assign it to a variable

byComp = df.groupby('Company')

In [19]:
#Then apply the aggregate function on it to get  a data frame
# The reason it cannot do it on person colum becaiuse that's a string

byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [20]:
# Other aggregate functions like sum(),max(), min(), std(), etc.

byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [23]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [24]:
#The below will return the sum of the Sales of FB

byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [25]:
#Summing up the whole code in one line

df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [28]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [31]:
#The describe function using groupby() will give us some useful information

df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0